# read design
read_verilog -sv foo.v
hierarchy -top foo

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty mycells.lib

# mapping logic to mycells.lib
abc -liberty mycells.lib

# show
show -notitle -stretch -format ps -prefix foo_fistshow

# write
write_verilog synthed_foo_mycellslib.v

# cleanup
clean